nvme0n1_fio_results/dev-nvme0n1_2023-07-17_14:55/rand_r_nvme0n1_1iodepth_1threads/8192.txt
rand-read: (g=0): rw=randread, bs=(R) 8192KiB-8192KiB, (W) 8192KiB-8192KiB, (T) 8192KiB-8192KiB, ioengine=libaio, iodepth=1
fio-3.7
Starting 1 thread
fio: cache invalidation of /dev/nvme0n1 failed: Permission denied

rand-read: (groupid=0, jobs=1): err= 0: pid=31701: Mon Jul 17 14:57:38 2023
   read: IOPS=541, BW=4332MiB/s (4543MB/s)(84.6GiB/20003msec)
    slat (usec): min=173, max=2364, avg=212.12, stdev=68.05
    clat (usec): min=830, max=4778, avg=1633.08, stdev=667.77
     lat (usec): min=1317, max=4989, avg=1845.40, stdev=665.56
    clat percentiles (usec):
     |  1.00th=[ 1172],  5.00th=[ 1237], 10.00th=[ 1303], 20.00th=[ 1369],
     | 30.00th=[ 1401], 40.00th=[ 1434], 50.00th=[ 1450], 60.00th=[ 1483],
     | 70.00th=[ 1532], 80.00th=[ 1582], 90.00th=[ 1795], 95.00th=[ 3032],
     | 99.00th=[ 4752], 99.50th=[ 4752], 99.90th=[ 4752], 99.95th=[ 4752],
     | 99.99th=[ 4752]
   bw (  MiB/s): min= 3568, max= 5008, per=99.99%, avg=4331.91, stdev=597.08, samples=40
   iops        : min=  446, max=  626, avg=541.45, stdev=74.60, samples=40
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=91.48%, 4=5.11%, 10=3.40%
  cpu          : usr=0.27%, sys=11.51%, ctx=10838, majf=0, minf=1574
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=10832,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=4332MiB/s (4543MB/s), 4332MiB/s-4332MiB/s (4543MB/s-4543MB/s), io=84.6GiB (90.9GB), run=20003-20003msec

Disk stats (read/write):
  nvme0n1: ios=689924/0, merge=0/0, ticks=760609/0, in_queue=741034, util=94.90%